laba11/app/controllers/admin_controller.rb

  def handling
    @rec = Calculation.all
---
SELECT "calculations".* FROM "calculations"

  def res
    @rec = Calculation.all
---
SELECT "calculations".* FROM "calculations"