laba11/app/models/calculation.rb

SELECT "calculations".* FROM "calculations" WHERE "calculations"."input" = ? LIMIT ?  [["input", 300], ["LIMIT", 1]]
---
    def find_res(n_val)
      JSON.parse(Calculation.find_by(input: n_val).json_responce) unless Calculation.find_by(input: n_val).nil?

INSERT INTO "calculations" ("input", "json_responce", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["input", 300], ["json_responce", "[[220,284]]"], ["created_at", "2019-11-25 16:59:30.806051"], ["updated_at", "2019-11-25 16:59:30.806051"]]
---
    def insert_res(n_val, res)
      record =  Calculation.new(input: n_val, json_responce: res.to_json)
      record.save unless record.valid?