laba12/app/controllers/admin_controller.rb

SELECT "calculations".* FROM "calculations"
---
  def handling
    @rec = Calculation.all

SELECT "calculations".* FROM "calculations"
---
  def res
    @rec = ConvertObject.call(obj: Calculation.all).res.to_xml