laba12/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-12-06 10:44:34.384914"], ["updated_at", "2019-12-06 10:44:34.384914"]]
---
  def create
    user_params
    @user = User.create_user(params)
    respond_to do |format|
      if !@user.nil? && @user.save