laba12/app/models/calculation.rb

class Calculation < ApplicationRecord
  validates :input, uniqueness: true

  class << self
    def find_res(n_val)
      return if Calculation.find_by(input: n_val).nil?

      JSON.parse(Calculation.find_by(input: n_val).json_responce)
---
INSERT INTO "calculations" ("input", "json_responce", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["input", 300], ["json_responce", "[[220,284]]"], ["created_at", "2019-11-25 16:59:30.806051"], ["updated_at", "2019-11-25 16:59:30.806051"]]
SELECT "calculations".* FROM "calculations" WHERE "calculations"."input" = ? LIMIT ?  [["input", 300], ["LIMIT", 1]]

    def insert_res(n_val, res)
      record = Calculation.new(input: n_val, json_responce: res.to_json)
      record.save if record.valid?
---
INSERT INTO "calculations" ("input", "json_responce", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["input", 3], ["json_responce", "[]"], ["created_at", "2019-12-06 07:03:54.823634"], ["updated_at", "2019-12-06 07:03:54.823634"]]