laba12/app/models/user.rb

INSERT INTO "users" ("login", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["login", "v"], ["password_digest", "4c94485e0c21ae6c41ce1dfe7b6bfaceea5ab68e40a2476f50208e526f506080"], ["created_at", "2019-12-06 10:35:53.521592"], ["updated_at", "2019-12-06 10:35:53.521592"]]
SELECT "users".* FROM "users" WHERE "users"."login" = ? LIMIT ?  [["login", "v"], ["LIMIT", 1]]
---
class User < ApplicationRecord
    validates :login, uniqueness: true

    class << self
        def authenticate(login, pass)
            usr = User.find_by(login: login)